# pandas

In [36]:
import pandas as pd
import numpy as np

In [5]:
df=pd.DataFrame(np.arange(10).reshape(2,5))
df

   0  1  2  3  4
0  0  1  2  3  4
1  5  6  7  8  9

In [2]:
import pandas as pd
df2=pd.read_csv('data/bc_data.csv')
df2.head()

,id,diagnosis,radius_mean,texture_mean,perimeter_mean,area_mean,smoothness_mean,compactness_mean,concavity_mean,concave points_mean,...,radius_worst,texture_worst,perimeter_worst,area_worst,smoothness_worst,compactness_worst,concavity_worst,concave_points_worst,symmetry_worst,fractal_dimension_worst
0,842302,M,17.99,10.38,122.80,1001.0,0.11840,0.27760,0.3001,0.14710,...,25.38,17.33,184.60,2019.0,0.1622,0.6656,0.7119,0.2654,0.4601,0.11890
1,842517,M,20.57,17.77,132.90,1326.0,0.08474,0.07864,0.0869,0.07017,...,24.99,23.41,158.80,1956.0,0.1238,0.1866,0.2416,0.1860,0.2750,0.08902
2,84300903,M,19.69,21.25,130.00,1203.0,0.10960,0.15990,0.1974,0.12790,...,23.57,25.53,152.50,1709.0,0.1444,0.4245,0.4504,0.2430,0.3613,0.08758
3,84348301,M,11.42,20.38,77.58,386.1,0.14250,0.28390,0.2414,0.10520,...,14.91,26.50,98.87,567.7,0.2098,0.8663,0.6869,0.2575,0.6638,0.17300
4,84358402,M,20.29,14.34,135.10,1297.0,0.10030,0.13280,0.1980,0.10430,...,22.54,16.67,152.20,1575.0,0.1374,0.2050,0.4000,0.1625,0.2364,0.07678

In [4]:
df2=df2[["id","diagnosis","area_mean"]]
df2.head()

         id diagnosis  area_mean
0    842302         M     1001.0
1    842517         M     1326.0
2  84300903         M     1203.0
3  84348301         M      386.1
4  84358402         M     1297.0

# 2 DataFrame 的 行 列

In [5]:
df2.index

RangeIndex(start=0, stop=569, step=1)

In [7]:
df2.index.size

569

# 3 访问元素的方法

In [8]:
df2.id.head()

0      842302
1      842517
2    84300903
3    84348301
4    84358402
Name: id, dtype: int64

In [9]:
df2["id"][2]

84300903

In [10]:
df2.id[2]

84300903

In [12]:
df2.id[[2,4,6]]

2    84300903
4    84358402
6      844359
Name: id, dtype: int64

In [13]:
df2.loc[1,"id"]

842517

In [14]:
df2.iloc[1,0]

842517

In [16]:
df2[["area_mean","id"]].head()

   area_mean        id
0     1001.0    842302
1     1326.0    842517
2     1203.0  84300903
3      386.1  84348301
4     1297.0  84358402

# 4 index

In [17]:
df2.index

RangeIndex(start=0, stop=569, step=1)

In [18]:
df2.columns

Index(['id', 'diagnosis', 'area_mean'], dtype='object')

In [19]:
df2["id"].head()

0      842302
1      842517
2    84300903
3    84348301
4    84358402
Name: id, dtype: int64

In [20]:
df2.reindex(index=["1","2","3"],columns=["1","2","3"])
df2.head()

         id diagnosis  area_mean
0    842302         M     1001.0
1    842517         M     1326.0
2  84300903         M     1203.0
3  84348301         M      386.1
4  84358402         M     1297.0

In [21]:
df2.reindex(index=[2,3,1],columns=["diagnosis","id","area_mean"])

  diagnosis        id  area_mean
2         M  84300903     1203.0
3         M  84348301      386.1
1         M    842517     1326.0

In [24]:
df3=df2.reindex(index=[2,3,1],columns=["diagnosis","id","area_mean","MyNewColumn"],fill_value=666)

In [25]:
df3

  diagnosis        id  area_mean  MyNewColumn
2         M  84300903     1203.0          666
3         M  84348301      386.1          666
1         M    842517     1326.0          666

# 5 删除或者过滤行列

In [28]:
df2=pd.read_csv('data/bc_data.csv')
df2=df2[["id","diagnosis","area_mean"]]
df2.head()

         id diagnosis  area_mean
0    842302         M     1001.0
1    842517         M     1326.0
2  84300903         M     1203.0
3  84348301         M      386.1
4  84358402         M     1297.0

In [29]:
df2.drop([2]).head()

         id diagnosis  area_mean
0    842302         M     1001.0
1    842517         M     1326.0
3  84348301         M      386.1
4  84358402         M     1297.0
5    843786         M      477.1

In [30]:
df2.head()

         id diagnosis  area_mean
0    842302         M     1001.0
1    842517         M     1326.0
2  84300903         M     1203.0
3  84348301         M      386.1
4  84358402         M     1297.0

In [31]:
df2.drop([3,4],axis=0,inplace=True)
df2.head()

         id diagnosis  area_mean
0    842302         M     1001.0
1    842517         M     1326.0
2  84300903         M     1203.0
5    843786         M      477.1
6    844359         M     1040.0

In [32]:
df2.head()

         id diagnosis  area_mean
0    842302         M     1001.0
1    842517         M     1326.0
2  84300903         M     1203.0
5    843786         M      477.1
6    844359         M     1040.0

In [34]:
df2[df2.area_mean>1100].head()

          id diagnosis  area_mean
1     842517         M     1326.0
2   84300903         M     1203.0
12    846226         M     1123.0
18    849014         M     1260.0
23    851509         M     1404.0

# 6 算术运算

In [37]:
df4=pd.DataFrame(np.arange(6).reshape(2,3))

In [38]:
df4

   0  1  2
0  0  1  2
1  3  4  5

In [39]:
df5=pd.DataFrame(np.arange(10).reshape(2,5))

In [40]:
df5

   0  1  2  3  4
0  0  1  2  3  4
1  5  6  7  8  9

In [41]:
df4+df5

   0   1   2   3   4
0  0   2   4 NaN NaN
1  8  10  12 NaN NaN

In [44]:
df6=df4.add(df5,fill_value=100)

In [45]:
df6

   0   1   2      3      4
0  0   2   4  103.0  104.0
1  8  10  12  108.0  109.0

In [56]:
s1=pd.Series(np.arange(10,13))

In [57]:
s1

0    10
1    11
2    12
dtype: int32

In [58]:
df6 - s1

      0    1    2   3   4
0 -10.0 -9.0 -8.0 NaN NaN
1  -2.0 -1.0  0.0 NaN NaN

In [59]:
df5=pd.DataFrame(np.arange(10).reshape(2,5))
s1=pd.Series(np.arange(3))
df5-s1

     0    1    2   3   4
0  0.0  0.0  0.0 NaN NaN
1  5.0  5.0  5.0 NaN NaN

In [60]:
df5=pd.DataFrame(np.arange(10).reshape(2,5))
s1=pd.Series(np.arange(3))
df5.sub(s1,axis=1)

     0    1    2   3   4
0  0.0  0.0  0.0 NaN NaN
1  5.0  5.0  5.0 NaN NaN

In [61]:
df5=pd.DataFrame(np.arange(10).reshape(2,5))
s1=pd.Series(np.arange(3))
df5.sub(s1,axis=0)

     0    1    2    3    4
0  0.0  1.0  2.0  3.0  4.0
1  4.0  5.0  6.0  7.0  8.0
2  NaN  NaN  NaN  NaN  NaN

# 7 大小比较

In [62]:
df6

   0   1   2      3      4
0  0   2   4  103.0  104.0
1  8  10  12  108.0  109.0

In [63]:
df6>5

       0      1      2     3     4
0  False  False  False  True  True
1   True   True   True  True  True

# 8 统计信息

In [52]:
import pandas as pd
import numpy as np
df2=pd.read_csv('data/bc_data.csv')
df2=df2[["id","diagnosis","area_mean"]]
df2.describe()

                 id    area_mean
count  5.690000e+02   569.000000
mean   3.037183e+07   654.889104
std    1.250206e+08   351.914129
min    8.670000e+03   143.500000
25%    8.692180e+05   420.300000
50%    9.060240e+05   551.100000
75%    8.813129e+06   782.700000
max    9.113205e+08  2501.000000

In [64]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 569 entries, 0 to 568
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   id         569 non-null    int64
 1   diagnosis  569 non-null    object
 2   area_mean  569 non-null    float64
dtypes: float64(1), int64(1), object(1)
memory usage: 13.5+ KB

In [65]:
dt=df2[df2.diagnosis=='M']

In [66]:
dt.head(3)

         id diagnosis  area_mean
0    842302         M     1001.0
1    842517         M     1326.0
2  84300903         M     1203.0

In [67]:
dt.tail()

         id diagnosis  area_mean
563  926125         M     1347.0
564  926424         M     1479.0
565  926682         M     1261.0
566  926954         M      858.1
567  927241         M     1265.0

In [69]:
df2[df2.diagnosis=='M'].count()

id           212
diagnosis    212
area_mean    212
dtype: int64

In [70]:
df2[["area_mean","id"]].head()

   area_mean        id
0     1001.0    842302
1     1326.0    842517
2     1203.0  84300903
3      386.1  84348301
4     1297.0  84358402

# 9 排序

### https://www.jianshu.com/p/f0ed06cd5003

In [71]:
df2.head(8)

         id diagnosis  area_mean
0    842302         M     1001.0
1    842517         M     1326.0
2  84300903         M     1203.0
3  84348301         M      386.1
4  84358402         M     1297.0
5    843786         M      477.1
6    844359         M     1040.0
7  84458202         M      577.9

In [72]:
df2.sort_values(by="area_mean",axis=0,ascending=True).head()

           id diagnosis  area_mean
101    862722         B      143.5
539    921362         B      170.4
538    921092         B      178.8
568     92751         B      181.0
46   85713702         B      201.9

In [75]:
df2.sort_values(by="area_mean",axis=0,ascending=False).head()

            id diagnosis  area_mean
461  911296202         M     2501.0
212    8810703         M     2499.0
180     873592         M     2250.0
352     899987         M     2010.0
82     8611555         M     1878.0

In [77]:
df2.sort_index(axis=1).head(3)

   area_mean diagnosis        id
0     1001.0         M    842302
1     1326.0         M    842517
2     1203.0         M  84300903

In [80]:
test=pd.DataFrame(np.arange(20).reshape(4,5))
test

    0   1   2   3   4
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19

In [84]:
test.sort_index(axis=1).head()

    0   1   2   3   4
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19

In [85]:
test.sort_index(axis=1,ascending=False).head()

    4   3   2   1   0
0   4   3   2   1   0
1   9   8   7   6   5
2  14  13  12  11  10
3  19  18  17  16  15

In [79]:
df2.sort_index(axis=1,ascending=False).head(3)

         id diagnosis  area_mean
0    842302         M     1001.0
1    842517         M     1326.0
2  84300903         M     1203.0

In [76]:
df2.sort_index(axis=0).head(3)

         id diagnosis  area_mean
0    842302         M     1001.0
1    842517         M     1326.0
2  84300903         M     1203.0

In [78]:
df2.sort_index(axis=0,ascending=False).head(3)

         id diagnosis  area_mean
568   92751         B      181.0
567  927241         M     1265.0
566  926954         M      858.1

# 10 导入导出

# 11 缺失数据处理

# 12 分组统计